src/config/Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.6">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НДС18</Name>
					<Comment>(Общ) Ставка НДС 18%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС18_118</Name>
					<Comment>(Общ) Расчетная ставка НДС 18% / 118%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
					<Comment>(Общ) Ставка НДС 10%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10_110</Name>
					<Comment>(Общ) Расчетная ставка НДС 10% / 110%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
					<Comment>(Общ) Ставка НДС 0%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
					<Comment>(Общ) Ставка НДС 20%</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20_120</Name>
					<Comment>(Общ) Расчетная ставка НДС 20% / 120%</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/config/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ) Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>(Общ) Код производителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаХраненияОстатков</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазоваяЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ) Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Набор</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппаЗатрат</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесовойКоэффициентВхождения</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетПоХарактеристикам</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВестиУчетПоСериям</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйМенеджерЗаПокупки</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоставщик</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновноеИзображение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХранилищеДополнительнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторСтранМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Comment>(Регл) Номер ГТД по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаДляОтчетов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Весовой</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипШтрихкода</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ТипыШтрихкодов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСБИС</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Размер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТовара</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Модель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МоделиТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Импорт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Типоразмеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АртикулСокр</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДефектаДляУценки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДефектовДляУценки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодТНВЭД</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторТНВЭД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКфайламСПрограммой</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/config/WebServices/ServiceIST/Ext/Module.bsl
Функция CreateSupplierOrder(Partner, Goods, Comment, DocNumber)
	Success = истина;
	Ошибка = "";
	
	URL = "www.yst.ru/ist";
	
	ТипXDTOРезультатОперации = ФабрикаXDTO.Тип(URL, "Result");
	РезультатОперации = ФабрикаXDTO.Создать(ТипXDTOРезультатОперации);
	
	
	Контрагент = Справочники.Контрагенты.НайтиПоКоду(СокрЛП(Partner));
	
	Если не ЗначениеЗаполнено(Контрагент) тогда
		Success = ложь;
		Ошибка = Ошибка+"Не найден контрагент с кодом "+СокрЛП(Partner)+"."; 
	КонецЕсли;
	
	Если Success тогда
		ДоговорПоставки = ПолучитьДоговорПоставки(Контрагент);
    КонецЕсли;

	Если не ЗначениеЗаполнено(ДоговорПоставки) тогда
		Success = ложь;
		Ошибка = Ошибка+"Не найден договор поставки."; 
	КонецЕсли;
	
	Если СокрЛП(DocNumber)="" тогда
		Success = ложь;
		Ошибка = Ошибка+Символы.ПС+"Не указан номер входящего документа.";
	КонецЕсли;
	
	//Поищем заказ по номеру входящего документа, который равен номеру заказа покупателя в базе ИСТ
	Если Success тогда
		ЗаказПоставщикуСсылка = НайтиЗаказПоставщику(Контрагент,СокрЛП(DocNumber));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗаказПоставщикуСсылка) тогда
		ЗаказПоставщикуОб = ЗаказПоставщикуСсылка.ПолучитьОбъект();
	Иначе
		ЗаказПоставщикуОб = Документы.ЗаказПоставщику.СоздатьДокумент();
		
		ЗаказПоставщикуОб.Дата = ТекущаяДата();
		ЗаказПоставщикуОб.ВалютаДокумента = Справочники.Валюты.НайтиПоКоду("643");
		ЗаказПоставщикуОб.Контрагент  = Контрагент;
		
		ДнейОтсрочки = ?(ДоговорПоставки.ДопустимоеЧислоДнейЗадолженности=0, 30, ДоговорПоставки.ДопустимоеЧислоДнейЗадолженности);
		
		ЗаказПоставщикуОб.ДатаПоступления = ТекущаяДата();
		ЗаказПоставщикуОб.ДатаОплаты = ТекущаяДата() + 24*60*60*ДнейОтсрочки;
		ЗаказПоставщикуОб.ДоговорКонтрагента = ДоговорПоставки;;
		ЗаказПоставщикуОб.Комментарий = СокрЛП(Comment);
		ЗаказПоставщикуОб.КратностьВзаиморасчетов  = 1;
		ЗаказПоставщикуОб.КурсВзаиморасчетов = 1;
		ЗаказПоставщикуОб.НомерВходящегоДокумента = СокрЛП(DocNumber);
		ЗаказПоставщикуОб.Организация = Справочники.Организации.НайтиПоКоду("00001");
		ЗаказПоставщикуОб.Подразделение = Справочники.Подразделения.НайтиПоКоду("00005");
		ЗаказПоставщикуОб.УчитыватьНДС = истина;
		ЗаказПоставщикуОб.СуммаВключаетНДС = истина;
		
		ТаблицаЗаказа = Новый ТаблицаЗначений;
		ТаблицаЗаказа.Колонки.Добавить("Номенклатура");
		ТаблицаЗаказа.Колонки.Добавить("НоменклатураСпр");
		ТаблицаЗаказа.Колонки.Добавить("Количество");
		ТаблицаЗаказа.Колонки.Добавить("Цена");
		
		Для каждого товар из Goods.Product цикл
			СтрокаТЗ = ТаблицаЗаказа.Добавить();
			СтрокаТЗ.Номенклатура = СокрЛП(товар.Code);
			СтрокаТЗ.Количество =  Число(товар.Quantity);
			СтрокаТЗ.НоменклатураСпр=Справочники.Номенклатура.НайтиПоКоду(СтрокаТЗ.Номенклатура);
			
			Если не ЗначениеЗаполнено(СтрокаТЗ.НоменклатураСпр) тогда
				Success = ложь;
				Ошибка = Ошибка+Символы.ПС+"Не найдена номенклатура с кодом: "+СокрЛП(товар.Code);
			КонецЕсли;
			
			СтрокаТЗ.Цена =  Число(товар.Price);
		КонецЦикла;
		
		
		Если Success тогда
			для каждого стр из  ТаблицаЗаказа цикл
				нстр = ЗаказПоставщикуОб.Товары.Добавить();
				нстр.Номенклатура = стр.НоменклатураСпр;
				нстр.Количество = стр.Количество;
				нстр.Цена = стр.цена;
				нстр.СтавкаНДС = Перечисления.СтавкиНДС.НДС18;
				нстр.ЕдиницаИзмерения = нстр.Номенклатура.ЕдиницаХраненияОстатков;
				
				ПриИзмененииНоменклатурыТабЧасти(нстр, ЗаказПоставщикуОб);
				
				// Рассчитываем реквизиты табличной части.
				РассчитатьСуммуТабЧасти(нстр, ЗаказПоставщикуОб);
				РассчитатьСуммуНДСТабЧасти(нстр, ЗаказПоставщикуОб);
			КонецЦикла;
			
			попытка
				ЗаказПоставщикуОб.Записать(РежимЗаписиДокумента.Проведение);
				//ЗаказПоставщикуОб.Записать(РежимЗаписиДокумента.Запись);
				ЗаказПоставщикуСсылка = ЗаказПоставщикуОб.Ссылка;
			исключение
				Success = ложь;
				Ошибка = Ошибка + Символы.ПС+ОписаниеОшибки();
				ЗаказПоставщикуСсылка = Документы.ЗаказПоставщику.ПустаяСсылка();
			КонецПопытки;
			
			Если Success тогда
				//Создадим задачу / отправим письмо
				Попытка
					Задача = Задачи.ЗадачиПользователя.СоздатьЗадачу();
					Задача.Дата = ТекущаяДата();
					Задача.Исполнитель = ЗаказПоставщикуОб.ДоговорКонтрагента.ОтветственноеЛицо;
					Задача.Наименование  = "Создан " + ЗаказПоставщикуСсылка + "от поставщика "+ЗаказПоставщикуОб.Контрагент;
					Задача.Описание = "Создан " + ЗаказПоставщикуСсылка + "от поставщика "+ЗаказПоставщикуОб.Контрагент;
					Задача.Оповещение  = истина;
					Задача.Объект = ЗаказПоставщикуСсылка;
					Задача.Записать();
					//письмо
					АдресПолучателя="200200140@yst.ru";
					УЗ = Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоКоду("00011");//1c@yst.ru
					СписокФайловВложений=Новый СписокЗначений;
					ТекстСообщения = "Создан заказ поставщику" + Символы.ПС + ЗаказПоставщикуСсылка;
					Тема = "Создан заказ поставщику "+ЗаказПоставщикуОб.Контрагент;  
					яштРезервыПоТоварам.ПослатьЭлектронноеПисьмо(АдресПолучателя,СписокФайловВложений, УЗ, ТекстСообщения, Тема);
				исключение
					Ошибка = Ошибка + Символы.ПС+ОписаниеОшибки();
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	РезультатОперации.Success		 = Success;
	РезультатОперации.OrderNumber	 = ЗаказПоставщикуСсылка.Номер;;
	РезультатОперации.Order		     = ""+ЗаказПоставщикуСсылка;
	РезультатОперации.Error			 = Ошибка;
	
	Возврат РезультатОперации;
КонецФункции

Функция ПолучитьДоговорПоставки(Контрагент)
	Запрос = новый Запрос;
	Запрос.Текст="ВЫБРАТЬ
	             |	ДоговорыКонтрагентов.Ссылка КАК ДоговорКонтрагента
	             |ИЗ
	             |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	             |ГДЕ
	             |	ДоговорыКонтрагентов.Владелец = &Владелец
	             |	И ДоговорыКонтрагентов.ПометкаУдаления = ЛОЖЬ
	             |	И ДоговорыКонтрагентов.Организация = &Организация
	             |	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	             |	И ДоговорыКонтрагентов.ТипДоговора = &ТипДоговора
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	ДоговорыКонтрагентов.Номер УБЫВ
	             |АВТОУПОРЯДОЧИВАНИЕ";
				 Запрос.УстановитьПараметр("Владелец",Контрагент);
				 Запрос.УстановитьПараметр("Организация",Справочники.Организации.НайтиПоКоду("00001"));
				 Запрос.УстановитьПараметр("ВидДоговора",Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
				 Запрос.УстановитьПараметр("ТипДоговора",Справочники.ТипыДоговоров.НайтиПоКоду("00027")); //поставка

				 Рез = Запрос.Выполнить().Выбрать();
				 
				 Пока Рез.Следующий() Цикл
					 Возврат Рез.ДоговорКонтрагента
				 КонецЦикла;
				 
				 Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
КонецФункции

Функция НайтиЗаказПоставщику(Контрагент,НомерВходящегоДокумента)
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПоставщику.Ссылка КАК ЗаказПоставщику
	               |ИЗ
	               |	Документ.ЗаказПоставщику КАК ЗаказПоставщику
	               |ГДЕ
	               |	ЗаказПоставщику.Контрагент = &Контрагент
	               |	И ЗаказПоставщику.НомерВходящегоДокумента = &НомерВходящегоДокумента
	               |	И ЗаказПоставщику.Дата МЕЖДУ &ДатаН И &ДатаК";
				   Запрос.УстановитьПараметр("Контрагент",Контрагент);
				   Запрос.УстановитьПараметр("НомерВходящегоДокумента",СокрЛП(НомерВходящегоДокумента));
				   Запрос.УстановитьПараметр("ДатаН",началоГода(ТекущаяДата()));
				   Запрос.УстановитьПараметр("ДатаК",КонецГода(ТекущаяДата()));
				   
				   Рез = Запрос.Выполнить().Выбрать();
				   
				   Пока Рез.Следующий() Цикл
					   возврат Рез.ЗаказПоставщику;
				   КонецЦикла;

				   Возврат Документы.ЗаказПоставщику.ПустаяСсылка();
КонецФункции
